
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/ShinyaIshitobi/sample-ecs-terraform/actions/runs/4114059858)



<pre><code>Apply complete! Resources: 4 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-07a8452976b37b3dc]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0ebd6f7341c251dbe]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-06106a0d2ef2c0116]
aws_security_group.alb: Refreshing state... [id=sg-0467d9d31d08bbee2]
aws_security_group.ecs: Refreshing state... [id=sg-00b7dae4665e9cfa0]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0452f38432ffd7bef]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-096adb5f450be3f7c]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0d4a0966656b7a904]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-05497d426229efa5b]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0f8a7f8dc43702913]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-047f345f74a757e67]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0b76ad8078b1e0da4]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0d6bbd6c377a6f278]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-1051370401]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0452f38432ffd7bef1080289494]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0c25eb5b25550c9cb]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-012e54b711e8d27cc]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0da2d81e4ab220b85]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0072642578ebc56ce]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-06546235e35e7b706]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-00d186c51cb1a8d0f]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0f8a7f8dc437029131080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-096adb5f450be3f7c1080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = (known after apply)
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "go-simple-server-alb"
      + preserve_host_header       = false
      + security_groups            = [
          + "sg-0467d9d31d08bbee2",
        ]
      + subnets                    = [
          + "subnet-0d4a0966656b7a904",
          + "subnet-0d6bbd6c377a6f278",
        ]
      + tags_all                   = (known after apply)
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_lb_listener.alb_listener will be created
  + resource "aws_lb_listener" "alb_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Fixed response content"
              + status_code  = "200"
            }
        }
    }

  # aws_lb_listener_rule.alb_lister_rule will be created
  + resource "aws_lb_listener_rule" "alb_lister_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {

          + path_pattern {
              + values = [
                  + "*",
                ]
            }
        }
    }

  # aws_lb_target_group.target_group will be created
  + resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "go-simple-server-target-group"
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-07a8452976b37b3dc"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/health_checks"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }

      + target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
aws_lb.alb: Creating...
aws_lb_target_group.target_group: Creating...
aws_lb_target_group.target_group: Creation complete after 2s [id=arn:aws:elasticloadbalancing:ap-northeast-1:975746537356:targetgroup/go-simple-server-target-group/c683412ba49094f7]
aws_lb.alb: Still creating... [10s elapsed]
aws_lb.alb: Still creating... [20s elapsed]
aws_lb.alb: Still creating... [30s elapsed]
aws_lb.alb: Still creating... [40s elapsed]
aws_lb.alb: Still creating... [50s elapsed]
aws_lb.alb: Still creating... [1m0s elapsed]
aws_lb.alb: Still creating... [1m10s elapsed]
aws_lb.alb: Still creating... [1m20s elapsed]
aws_lb.alb: Still creating... [1m30s elapsed]
aws_lb.alb: Still creating... [1m40s elapsed]
aws_lb.alb: Still creating... [1m50s elapsed]
aws_lb.alb: Still creating... [2m0s elapsed]
aws_lb.alb: Still creating... [2m10s elapsed]
aws_lb.alb: Creation complete after 2m13s [id=arn:aws:elasticloadbalancing:ap-northeast-1:975746537356:loadbalancer/app/go-simple-server-alb/cb62733d2186c778]
aws_lb_listener.alb_listener: Creating...
aws_lb_listener.alb_listener: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:975746537356:listener/app/go-simple-server-alb/cb62733d2186c778/55b18cc47058921d]
aws_lb_listener_rule.alb_lister_rule: Creating...
aws_lb_listener_rule.alb_lister_rule: Creation complete after 0s [id=arn:aws:elasticloadbalancing:ap-northeast-1:975746537356:listener-rule/app/go-simple-server-alb/cb62733d2186c778/55b18cc47058921d/bf0307794bf864cc]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":9,"Program":"tfcmt","SHA1":"68c2884ffae896c69c3636a44d24cd2d16d3309b","Vars":{},"WorkflowName":"Terraform"} -->